# TrussMemberInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TrussMemberInfo Constructor
TrussMemberInfo Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TrussMemberInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TrussMemberInfo()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace